#include "pch.h"

struct tagInfo
{
	int	iHp;
};

int main()
{
	// - 절차 지향 프로그램 : '~하다'의 동사 중심의 언어(함수), 함수들이 각지 자신들의 기능을 절차에 따라 호출
	// - 객체 지향 프로그램 : 주어에 중심의 둔 프로그래밍 언어

	// O.O.P(Object Oriented Programming) : 프로그래밍을 구성하는 각 객체 간의 의사소통 구조로 프로그래밍 하는 것
	// 
	// - 객체 : 실 세계를 구성하는 하나의 실체

	// 객체 = 인스턴스 + 클래스

	// 클래스 = 데이터 집합체(멤버 변수, 상수) + 기능 집합체(멤버 함수)

	// c++의 성격

	// 1. 객체 지향 프로그래밍 특성 : 추상화(공통된 요소들을 추출하는 작업)
	// 클래스의 특성(속성) : 은닉화, 캡슐화, 상속성, 다형성

	// 2. 일반화 프로그래밍 : 자료형과 상관 없이 지속 사용 가능한 문법을 제공하는 프로그래밍

	return 0;
}
